export enum EHttpErrorCode {
  // 系统错误码
  '00000' = '一切 ok',
  'A0001' = '用户端错误',
  'A0002' = '请求次数超过限制',
  'A0003' = '请联系管理员添加白名单',
  'A0004' = '获取不到客户端 IP',
  'A0005' = '未经授权',
  'A0006' = '请求参数校验出错',
  'A0007' = '未经授权,被挤下线',
  'A0008' = '没有权限操作',

  // User: A0800-A0900
  'A0800' = '您的账号已被临时禁用，建议您联系管理员处理。',
  'A0801' = '账号已经存在',
  'A0802' = '账号或者密码错误',
  'A0803' = '手机号不存在',
  'A0804' = '手机号已经存在',
  'A0805' = '邮箱已经存在',
  'A0806' = '验证码不对',
  'A0807' = '图像验证码生成失败',
  'A0808' = '图像验证码不对',
  'A0809' = '图像验证码ID不对',
  'A0810' = '账号不存在，请联系管理员创建账号',
  'A0811' = '手机验证码一天最多只能发十次',
  'A0819' = '该号码一小时内发送过',
  'A0820' = '验证码失效',
  'A0821' = '账号密码错误已达5次，请1小时后重试，联系我们手动处理；',
  'A0822' = '账号密码错误已达5次，账号被锁定；',
  'A0824' = '原密码输入不正确',
  'A0825' = '已经修改过',
  'A0826' = 'OCR识别失败',
  'A0827' = '密码输入不正确',
  'A0828' = '获取手机号失败',
  'A0829' = '获取带参数二维码失败',
  'A0830' = '密钥错误',
  'A0831' = 'IP已经被限流',

  // Dept: A0900-A1000
  'A0900' = '上级部门不存在',

  // 系统错误
  'B0001' = '系统执行出错',
  'B0100' = '系统执行超时',
  'B0101' = '数据库报错',
  'B0102' = '系统没有这个接口',
  'B0103' = '请求超时',

  // 第三方错误
  'C0001' = '调用第三方服务出错',
  'C0002' = '调用商城服务出错',
}
